# y = kx + b

# ------------- 数据获取 ---------------
xs = [i for i in range(2000, 2023)]
ys = [5000, 8000, 12000, 15000, 14000, 18000, 20000, 25000, 26000, 32000, 40000, 42000, 46000, 50000, 51000, 53000,
      53000, 54000, 57000, 58000, 59000, 59900, 60000]

# -------------- 数据处理 ------------

# -------------- 参数定义 ------------
k = 1
b = 0
lr = 0.01
epoch = 20

# -------------------------- 模型训练  ------------
for e in range(epoch):
    for x, y in zip(xs, ys):
        # -------------- 求预测值 （模型预测、模型推理） ------------
        predict = k * x + b

        # 求解loss 值
        loss = (predict - y) ** 2

        # 计算梯度值
        # delta_x = 2 * (predict - y) *
        delta_k = 2 * (predict - y) * x
        delta_b = 2 * (predict - y) * 1

        # 更新参数
        k = k - delta_k * lr
        b -= delta_b * lr

# 模型上线 及 预测
input_x = input("请输入年份：")
p = k * (int(input_x)) + b
print(f"{input_x}年的房价为：{p}")
